package util

// TeamUtil チーム成績情報処理のUtil
type TeamUtil struct{}

// GetTeamID 引数で受け取ったチーム名とイニシャルからチームIDを取得する
func (TeamUtil *TeamUtil) GetTeamID(teamName string) (teamID string) {
	idDatas := map[string][]string{
		"01": {"巨 人", "巨　人", "読 売ジャイアンツ", "読　売ジャイアンツ", "読　売", "g"},
		"02": {"横 浜", "横 浜ベイスターズ", "DeNA", "横浜DeNAベイスターズ", "横　浜", "横浜DeNA", "db"},
		"03": {"阪 神", "阪　神", "阪 神タイガース", "阪　神タイガース", "t"},
		"04": {"広 島", "広　島", "広島東洋カープ", "広島東洋", "c"},
		"05": {"中 日", "中　日", "中 日ドラゴンズ", "中　日ドラゴンズ", "d"},
		"06": {"ヤクルト", "ヤクルトスワローズ", "東京ヤクルトスワローズ", "東京ヤクルト", "s"},
		"07": {"西 武", "西　武", "西 武ライオンズ", "埼玉西武ライオンズ", "埼玉西武", "l"},
		"08": {"ソフトバンク", "福岡ソフトバンクホークス", "福岡ソフトバンク", "福岡ダイエー", "h"},
		"09": {"楽 天", "楽　天", "東北楽天ゴールデンイーグルス", "東北楽天", "e"},
		"10": {"ロッテ", "千葉ロッテマリーンズ", "千葉ロッテ", "m"},
		"11": {"日本ハム", "北海道日本ハムファイターズ", "北海道日本ハム", "f"},
		"12": {"オリックス", "オリックスバファローズ", "大阪近鉄", "b"},
	}
	for key, idData := range idDatas {
		for _, idName := range idData {
			if idName == teamName {
				return key
			}
		}
	}
	return "13"
}
